# Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
# 456 -> 3
# 78 -> 2
# 89126 -> 5

x = input("Введите число N: ")
print("Количество цифр в числе ", x, " = ", len(x))