# Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых,
# заданных уравнениями y = k1 * x + b1, y = k2 * x + b2;
# значения b1, k1, b2 и k2 задаются пользователем.
# b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)

b1 = round(float(input("Введите координату B1: ")),2)
k1 = round(float(input("Введите координату K1: ")),2)
b2 = round(float(input("Введите координату B2: ")),2)
k2 = round(float(input("Введите координату K2: ")),2)

x = round((b2 - b1) / (k1 - k2),2)
y = round(k1 * x + b1, 2)
print("Точка пересечения двух прямых [", b1,",",k1,"] и [",b2,",",k2,"] ->  [",x,",",y,"]")
